@ECHO OFF

:: ---------------------------------
:: FIX ภาษาต่างด้าว (Encoding)
CHCP 65001
:: ---------------------------------

CLS

REM ================================================================
REM ==       ⬇️⬇️⬇️ แก้ตรงนี้เลยเหมา! ⬇️⬇️⬇️       ==
REM ================================================================
:: ตั้งชื่อ Commit ของนายตรงนี้เลยจ้า (ใส่ในเครื่องหมาย "")
SET COMMIT_MESSAGE="เพิ่มเสียงเครื่องคิดเลข 2.8.9"
REM ================================================================


ECHO.
ECHO ---------------------------------------------------
ECHO  🔥 เริ่มการส่งงานขึ้น GITHUB จ้า... 🔥
ECHO ---------------------------------------------------
ECHO.

ECHO 🧐 [STEP 1] เช็คสถานะไฟล์แป๊บ... (git status)
git status
ECHO.

ECHO 📦 [STEP 2] กำลังยัดไฟล์ทั้งหมดเข้าระบบ! (git add .)
git add .
ECHO "เพิ่มไฟล์เรียบร้อย!"
ECHO.

ECHO ✍️ [STEP 3] กำลังปั๊มตรา... (git commit)
git commit -m %COMMIT_MESSAGE%
ECHO "Commit ด้วยข้อความ: %COMMIT_MESSAGE%"
ECHO.

ECHO 📤 [STEP 4] ส่งขึ้นฟ้าาาา! (git push)
git push
ECHO.

ECHO ✨✨✨ เรี๊ยบร้อย! งานของนายขึ้น GitHub แล้ว! ✨✨✨
ECHO.
PAUSE